#include "SceneManager.h"
#include "SoundManager.h"
#include "DxLib.h"
#include "ImageManager.h"

int clearCounter = 0;
//---------------------------------------------------------------------------------
//	初期化
//---------------------------------------------------------------------------------
void ClearInit()
{
	clearCounter = 0;
	SoundManager::GetInstance().StopAllBGM();
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void ClearUpdate()
{
	clearCounter++;
	if (clearCounter > 300)
	{
		//	次に行きたいシーン番号を設定しています
		scene_next = SCENE_ENDING;
	}
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void ClearRender()
{
	DrawBox(0, 0, SCREEN_W, SCREEN_H, GetColor(0, 0, 0), true);
	DrawRotaGraph(SCREEN_W * 0.5, SCREEN_H * 0.45, 2.0f, 0, ImageManager::GetInstance().GetImage(IMAGE_CLEAR), true);
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void ClearExit()
{
}
