#include "Main.h"
#include "SceneManager.h"

#include "Title.h"	//	タイトル関係の関数を呼びたいので
#include "Stage.h"	//	ステージ関係の関数を呼びたいので
#include "Clear.h"	//	リザルト（結果表示画面）関係の関数を呼びたいので
#include "Ending.h"	//	エンディング関係の関数を呼びたいので
#include "Gameover.h"
#include "ImageManager.h"





//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void SceneManager::Update()
{
}

//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void SceneManager::Render()
{

}
//---------------------------------------------------------------------------------
//	終了処理

SceneManager::SceneManager()
{
}

SceneManager::~SceneManager()
{
}

SceneManager& SceneManager::GetInstance()
{
	static SceneManager instance;
	return instance;
}